<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a9cc645f3a0cd443cce8ac0e182e4b7aab88ee41a4dc8a44f6dfae9b64134e05","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #933 at https://github.com/cal-itp/data-infra/actions/runs/19148547341","plan_out_hash":"645893e784130120ac098fc30c6225675515661092250faf7de349c5d5ee4d18","plan_hash":"401831358237a0a032d9e5315af26ce2fc4655a4bce139b1e5abf37ea37298cd","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/publish_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "1wVUUg==" -> (known after apply)
!~      detect_md5hash      = "+nBTrnLGt3kJTaFeFB0L6A==" -> "different hash"
!~      generation          = 1762380823396220 -> (known after apply)
        id                  = "calitp-staging-composer-dags/publish_gtfs.py"
!~      md5hash             = "+nBTrnLGt3kJTaFeFB0L6A==" -> (known after apply)
        name                = "dags/publish_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/ckan_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Ny8SnQ==" -> (known after apply)
!~      detect_md5hash      = "z2cK/dimE4LMmKtT2S/gpQ==" -> "different hash"
!~      generation          = 1762456604670473 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/ckan_hook.py"
!~      md5hash             = "z2cK/dimE4LMmKtT2S/gpQ==" -> (known after apply)
        name                = "plugins/hooks/ckan_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/dbt_bigquery_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "eEndSQ==" -> (known after apply)
!~      detect_md5hash      = "8XRxcQijMftULVc6N4stMQ==" -> "different hash"
!~      generation          = 1762455027296994 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/dbt_bigquery_to_gcs_operator.py"
!~      md5hash             = "8XRxcQijMftULVc6N4stMQ==" -> (known after apply)
        name                = "plugins/operators/dbt_bigquery_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "wl6llg==" -> (known after apply)
!~      detect_md5hash      = "HF+Xx6KjvceJ7rl0YQjZKA==" -> "different hash"
!~      generation          = 1762455898381153 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "HF+Xx6KjvceJ7rl0YQjZKA==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #933](https://github.com/cal-itp/data-infra/actions/runs/19148547341)